glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC1800_DFP.pdsc
      <sequences>

        <!-- Pre-defined Debug Access Sequences -->

        <!-- Begin: Pre-defined ResetProcessor Sequence -->
        <sequence name="ResetSystem">
          <!-- Default implementation -->
          <block>
            // Execute VECTRESET via AIRCR
            Write32(0xE000ED0C, 0x05FA0001);
          </block>

          <control if="VecResetWithPeriph">
            <block>
              // Reset peripherals
              Write32(0x40053100, 0xFFDF0030); // RESET_CTRL0
              Write32(0x40053104, 0xFFFFFFFF); // RESET_CTRL1
            </block>
          </control>
        </sequence>
        <!-- End: Pre-defined ResetProcessor Sequence -->

        <!-- Begin: Pre-defined ResetCatchSet Sequence -->
        <sequence name="ResetCatchSet">
          <block>
            __var chipID = 0;

            // Read chip ID
            chipID = Read32(0x40043200);
          </block>

          <control if="chipID == 0x4284E02B || chipID == 0x7284E02B">
            <!-- LPC1857/53 (parts with on-chip flash: Rev '-' and Rev A) -->
            <block>
              __var resetVecBankA = 0;
              __var resetVecBankB = 0;
              __var value         = 0;

              // Clear Reset Vector Catch
              Write32(0xE000EDFC, Read32(0xE000EDFC) &amp; (~0x00000001));

              // Read reset vector from bank A
              resetVecBankA = Read32(0x1A000004);
              // Read reset vector from bank B
              resetVecBankB = Read32(0x1B000004);
            </block>

            <control if="resetVecBankA &lt; 0x20000000">
              <!-- Reset Vector of bank A in HW Breakpoint range-->
              <control if="(resetVecBankA &amp; 0x2) == 0">
                <block>
                  // Even Address
                  Write32(0xE0002008, (resetVecBankA &amp; 0x1FFFFFFC) | 0x40000001); // Write address to FPB Comparator 0
                </block>
              </control>
              <control if="resetVecBankA &amp; 0x2">
                <block>
                  // Odd Address
                  Write32(0xE0002008, (resetVecBankA &amp; 0x1FFFFFFC) | 0x80000001); // Write address to FPB Comparator 0
                </block>
              </control>
              <block>
                // Enable FPB
                Write32(0xE0002000, 0x00000003);
              </block>
            </control>

            <control if="resetVecBankA &gt;= 0x20000000" info="Enable reset vector catch">
              <block>
                // Enable Reset Vector Catch in DEMCR
                Write32(0xE000EDFC, (Read32(0xE000EDFC) | 0x00000001));
              </block>
            </control>

            <control if="resetVecBankB &lt; 0x20000000">
              <!-- Reset Vector of bank B in HW Breakpoint range-->
              <control if="(resetVecBankB &amp; 0x2) == 0">
                <block>
                  // Even Address
                  Write32(0xE000200C, (resetVecBankB &amp; 0x1FFFFFFC) | 0x40000001); // Write address to FPB Comparator 1
                </block>
              </control>
              <control if="resetVecBankA &amp; 0x2">
                <block>
                  // Odd Address
                  Write32(0xE000200C, (resetVecBankB &amp; 0x1FFFFFFC) | 0x80000001); // Write address to FPB Comparator 1
                </block>
              </control>
              <block>
                // Enable FPB
                Write32(0xE0002000, 0x00000003);
              </block>
            </control>

            <control if="resetVecBankB &gt;= 0x20000000" info="Enable reset vector catch">
              <block>
                // Enable Reset Vector Catch in DEMCR
                Write32(0xE000EDFC, (Read32(0xE000EDFC) | 0x00000001));
              </block>
            </control>

          </control>
        </sequence>
        <!-- End: Pre-defined ResetCatchSet Sequence -->

        <!-- Begin: Pre-defined ResetCatchClear Sequence -->
        <sequence name="ResetCatchClear">
          <block>
            // Clear FPB Comparators 0 and 1
            Write32(0xE0002008, 0x00000000);
            Write32(0xE000200C, 0x00000000);

            // Disable FPB
            Write32(0xE0002000, 0x00000002);

            // Clear Reset Vector Catch
            Write32(0xE000EDFC, Read32(0xE000EDFC) &amp; (~0x00000001));
          </block>
        </sequence>
        <!-- End: Pre-defined ResetCatchClear Sequence -->

        <!-- Begin: Pre-defined TraceStart Sequence -->
        <sequence name="TraceStart">
          <block>
            // Nothing required for SWO Trace
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;
            __var traceBuffer = (__traceout &amp; 0x4) != 0;
          </block>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");
            </block>
          </control>

          <control if="traceBuffer">
            <block>
              Sequence("EnableTraceBuffer");
            </block>
          </control>
        </sequence>
        <!-- End: Pre-defined TraceStart Sequence -->

        <!-- Begin: Pre-defined TraceStop Sequence -->
        <sequence name="TraceStop">
          <block>
            // Nothing required for SWO Trace
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;
            __var traceBuffer = (__traceout &amp; 0x4) != 0;
          </block>

          <control if="traceTPIU">
            <block>
              Sequence("DisableTraceTPIU");
            </block>
          </control>

          <control if="traceBuffer">
            <block>
              Sequence("DisableTraceBuffer");
            </block>
          </control>
        </sequence>
        <!-- End: Pre-defined TraceStop Sequence -->

        <!-- User-defined Debug Access Sequences -->

        <!-- Begin: User-defined EnableTraceTPIU Sequence -->
        <sequence name="EnableTraceTPIU">
          <block>
            __var tracePortWidth = (__traceout &amp; 0x003F0000) &gt;&gt; 16;

