glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC1800_DFP.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="USB0" Capiversion="2.1.0" Cversion="2.10.0" condition="LPC1800 CMSIS SCU">
      <description>USB0 Device Driver for the LPC1800 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD0_LPC18xx.c"/>
        <file category="source" name="RTE_Driver/USB0_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="USB1" Capiversion="2.1.0" Cversion="2.7.0" condition="LPC1800 CMSIS SCU">
      <description>USB1 Device Driver for the LPC1800 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD1               /* Driver USBD1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD1_LPC18xx.c"/>
        <file category="source" name="RTE_Driver/USB1_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="USB0" Capiversion="2.0.0" Cversion="2.4.0" condition="LPC1800 CMSIS SCU">
      <description>USB0 EHCI Host Driver for the LPC1800 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBH0_LPC18xx.c"/>
        <file category="source" name="RTE_Driver/USB0_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="USB1" Capiversion="2.0.0" Cversion="2.4.0" condition="LPC1800 CMSIS SCU">
      <description>USB1 EHCI Host Driver for the LPC1800 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH1               /* Driver USBH1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBH1_LPC18xx.c"/>
        <file category="source" name="RTE_Driver/USB1_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1.0" Cversion="2.8.0" condition="LPC1800 CMSIS RTOS SCU">
      <description>Ethernet MAC Driver for LPC1800 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/EMAC_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.2.0" Cversion="2.5.0" condition="LPC1800 CMSIS SCU">
      <description>MCI Driver for LPC1800 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/MCI_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2.0" Cversion="2.4.0" condition="LPC1800 CMSIS SCU">
      <description>I2C Driver for LPC1800 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C0                /* Driver I2C0 */
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2C_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="SSP" Capiversion="2.1.0" Cversion="2.9.0" condition="LPC1800 CMSIS SCU GPIO GPDMA">
      <description>SPI (SSP) Driver for LPC1800 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SSP_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1.0" Cversion="2.11.0" condition="LPC1800 CMSIS SCU GPDMA">
      <description>USART Driver for LPC1800 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART0              /* Driver USART0 */
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USART_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SAI" Csub="I2S" Capiversion="1.0.0" Cversion="1.4.0" condition="LPC1800 CMSIS SCU GPDMA">
      <description>SAI (I2S) Driver for LPC1800 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SAI0                /* Driver SAI0 */
        #define RTE_Drivers_SAI1                /* Driver SAI1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2S_LPC18xx.c"/>
      </files>
    </component>

    <!-- MCB1800 Development Board -->
    <bundle Cbundle="MCB1800" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil Development Board MCB1800</description>
      <doc>Documents/mcb1800.chm</doc>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="LPC1800 CMSIS SCU">
        <description>A/D Converter interface for Keil MCB1800 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/ADC_MCB1800.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="LPC1800 CMSIS SCU GPIO">
        <description>LED interface for Keil MCB1800 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/LED_MCB1800.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC1800 CMSIS SCU GPIO">
        <description>Buttons interface for Keil MCB1800 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/Buttons_MCB1800.c"/>
        </files>
      </component>
