glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC1800_DFP.pdsc
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="LPC1800 CMSIS SCU GPIO">
        <description>Joystick interface for Keil MCB1800 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/Joystick_MCB1800.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="LPC1800 CMSIS SCU GPIO SPI">
        <description>Graphic LCD interface for Keil MCB1800 Development Board</description>
        <files>
          <file category="header" name="Boards/Keil/MCB1800/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Keil/MCB1800/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Keil/MCB1800/Common/GLCD_MCB1800.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="RGB IF" condition="LPC1800 CMSIS SCU GPIO SPI Display">
        <description>emWin LCD RGB Interface for Keil MCB1800 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/LCD_X.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" Csub="STMPE811" condition="LPC1800 CMSIS RTOS and I2C Driver">
        <description>Touchscreen interface for STMPE811</description>
        <files>
          <file category="header" name="Boards/Keil/MCB1800/Common/STMPE811.h"/>
          <file category="source" name="Boards/Keil/MCB1800/Common/Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="Thermometer" Capiversion="1.0.0" Csub="LM75" condition="LPC1800 CMSIS I2C Driver">
        <description>Thermometer interface for LM75</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/Thermometer_LM75.c"/>
        </files>
      </component>
      <component Cgroup="EEPROM" Capiversion="1.0.0" Csub="24LC128" condition="LPC1800 CMSIS I2C Driver">
        <description>EEPROM interface for 24LC128</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/EEPROM_24LC128.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Capiversion="1.1.0" condition="LPC1800 CMSIS SCU GPIO SAI/I2C Driver">
        <description>Audio interface for UDA1380</description>
        <files>
          <file category="source" name="Boards/Keil/MCB1800/Common/Audio_UDA1380.c"/>
        </files>
      </component>
    </bundle>
  </components>
</package>
